
local __ = {}

-- 小程序权限集
-- https://developers.weixin.qq.com/doc/oplatform/Third-party_Platforms/2.0/product/miniprogram_authority.html
local miniprogram_authority = {
    { 17, "获取小程序码", "基于该权限可获取小程序码和小程序二维码" },
    { 18, "小程序开发与数据分析", "基于该权限可进行小程序开发以及代码管理和数据分析析。注意，小程序的开发权限集授权给服务商后，为了避免代码版本互相覆盖 ，小程序则无法再通过mp进行发版本。", true },
    { 19, "小程序客服管理", "基于该权限可实现在小程序中接收和发送客服消息以进行小程序客服消息管理" },
    { 25, "开放平台帐号管理", "基于该权限可实现将小程序绑定/解除绑定开放平台帐号", true },
    { 30, "小程序基本信息管理", "基于该权限可设置小程序名称、头像、简介、类目等基本信息" },
    { 31, "小程序认证名称检测", "基于该权限可进行检测小程序认证的名称是否符合规则" },
    { 36, "微信卡路里管理", "基于该权限可为小程序提供用户卡路里同步、授权查询、兑换功能" },
    { 37, "附近的小程序管理", "基于该权限可为小程序创建附近地点，并设置小程序展示在“附近的小程序”入口中" },
    { 40, "小程序插件管理", "基于该权限可代小程序申请、添加和使用插件并进行管理", true },
    { 41, "好物圈管理", "基于该权限将小程序的物品、订单、收藏等信息同步至好物圈", true },
    { 45, "微信物流服务", "基于该权限可以使用发货、查询组件、消息组件等微信物流服务", true },
    { 48, "微信财政电子票据管理", "基于该权限可为小程序完成微信财政电子票据授权、插卡及报销等功能" },
    { 49, "小程序云开发管理", "基于该权限可为小程序管理云开发资源", true, "《微信小程序·云开发功能服务条款》", "https://developers.weixin.qq.com/miniprogram/product/service/cloudbase.html" },
    { 51, "小程序即时配送", "基于该权限可为小程序快速高效对接多家配送公司的配送服务", true },
    { 52, "小程序直播管理", "基于该权限可为有直播需求的小程序实现直播以及直播间管理等功能", false, "《微信小程序直播功能服务条款》", "https://developers.weixin.qq.com/miniprogram/product/service/live.html" },
    { 57, "小程序搜索", "基于该权限可将小程序页面推送给搜索引擎，增加小程序页面在搜索的收录与曝光机会" },
    { 65, "小程序广告管理", "基于该权限可为小程序广告主进行微信广告的投放和管理" },
    { 67, "微信服务平台管理", "基于该权限可代小程序调用在微信服务平台购买的API资源" },
    { 70, "标准版交易组件商品管理", "基于该权限可对小商店或者标准版交易组件的商品及库存信息进行管理" },
    { 71, "标准版交易组件订单物流与售后管理", "基于该权限可对小商店或者标准版交易组件的订单、物流信息及售后相关内容进行管理" },
    { 73, "标准版交易组件接入", "基于该权限可快速开通小程序并同时开通标准版交易组件，或者快速调用接口开通小商店", true },
    { 76, "小程序违规与交易投诉管理", "基于该权限可接收小程序违规信息和发起申诉请求以及可用于接收、查询、处理小程序用户交易类投诉", true },
    { 81, "试用小程序快速认证", "基于该权限可为试用小程序快速完成认证", true },
    { 84, "标准版交易组件优惠券管理", "基于该权限可对小商店或者标准版交易组件的优惠券进行管理，可完成优惠券的制作、发放、信息的搜集等功能" },
    { 85, "自定义版交易组件管理", "基于该权限可为小程序实现自定义版交易组件的接入、商品、订单、物流、售后管理等功能", true },
    { 86, "小商店装修", "基于该权限实现小商店的装修功能" },
    { 88, "小程序链接管理", "基于该权限可获取小程序URL Scheme、URL Link以及Short Link，从而实现从短信、邮件、微信外网页等场景打开小程序以及在微信内拉起小程序" },
    { 93, "小程序联盟管理", "基于该权限可为需要推广商品的推客查询商品、并生成相应的推广素材，推广完成后可为推客查询推广订单明细" },
    { 99, "云开发短信服务", "基于该权限可为小程序提供基于云开发的短信服务，可实现从短信打开云开发静态页面或小程序" },
    { 102, "云开发微信支付", "基于该权限可为小程序使用基于云开发的绑定微信支付商户号、查询绑定的商户号等功能" },
    { 104, "标准版组件资金链路", "基于该权限可以查询标准版组件/小商店资金相关的流水、账户等，可以进行账户的提现等操作", true },
    { 105, "城市服务", "基于该权限可帮助小程序使用微信城市服务功能" },
    { 112, "红包封面管理", "基于该权限可对红包封面相关能力进行管理" },
}

-- 公众号权限集
-- https://developers.weixin.qq.com/doc/oplatform/Third-party_Platforms/2.0/product/offical_account_authority.html
local offical_account_authority = {
    { 1, "消息管理", "基于该权限可帮助公众号接收用户消息，进行人工客服回复或自动回复" },
    { 2, "用户管理", "基于该权限可帮助公众号获取用户基本信息，进行用户分组管理" },
    { 3, "帐号服务", "基于该权限可帮助公众号设置及展示公众号信息、配置账号信息、生成带参二维码并配置跳转小程序等账号维度的功能" },
    { 4, "网页服务", "基于该权限可帮助公众实现H5网页服务" },
    { 5, "微信小店", "基于该权限可帮助公众号使用微信小店功能" },
    { 6, "微信多客服", "基于该权限可帮助公众号使用微信多客服功能" },
    { 7, "群发与通知", "基于该权限可帮助公众号进行群发消息、文章管理以及发送模板消息" },
    { 8, "微信卡券", "基于该权限可帮助公众号使用微信卡券功能", false, "《微信公众平台卡券功能服务协议》", "https://mp.weixin.qq.com/cgi-bin/readtemplate?t=cardticket/faq_apply_card_tmpl" },
    { 9, "微信扫一扫", "基于该权限可帮助公众号使用微信扫一扫功能", false, "《微信公众平台扫一扫功能使用条款》", "https://mp.weixin.qq.com/cgi-bin/announce?action=getannouncement&key=1503978618&version=1&lang=zh_CN&platform=2" },
    { 10, "微信连WIFI", "基于该权限可帮助公众号使用微信连WIFI功能" },
    { 11, "素材管理", "基于该权限可帮助公众号管理图文等多媒体素材以及多媒体文件管理" },
    { 12, "微信摇周边", "基于该权限可帮助公众号使用微信摇周边功能" },
    { 13, "微信门店", "基于该权限可帮助公众号使用微信门店功能" },
    { 15, "菜单管理", "基于该权限可帮助公众号使用自定义菜单功能进行菜单管理" },
    { 22, "城市服务", "基于该权限可帮助公众号使用微信城市服务功能" },
    { 23, "广告管理", "基于该权限可帮助公众号广告主进行微信广告的投放和管理" },
    { 24, "开放平台帐号管理", "基于该权限可帮助公众号实现绑定开放平台帐号功能", true },
    { 26, "微信电子发票", "基于该权限可帮助公众号使用微信电子发票功能" },
    { 27, "快速注册小程序", "基于该权限可帮助公众号实现复用公众号资质快速注册小程序功能" },
    { 33, "小程序关联管理", "基于该权限可实现将小程序关联/解除关联公众号" },
    { 34, "微信商品库管理", "基于该权限可帮助公众号商家导入、更新、查询微信商品库的商品信息", true },
    { 35, "微信卡路里", "基于该权限可帮助公众号提供用户卡路里同步、授权查询、兑换等功能" },
    { 44, "好物圈", "基于该权限可帮助公众号将物品、订单、收藏等信息同步至好物圈" },
    { 46, "微信一物一码", "基于该权限可帮助公众号使用微信一物一码功能" },
    { 47, "微信财政电子票据", "基于该权限可帮助公众号完成授权、插卡及报销等功能" },
    { 54, "服务号对话管理", "基于该权限可帮助公众号配置对话能力，管理顾问、客户、标签和素材等功能", true, "《微信服务号对话能力功能服务条款》", "https://mp.weixin.qq.com/cgi-bin/announce?action=getannouncement&key=11582281044htScz&version=1&lang=zh_CN&platform=2&token=684760106" },
    { 66, "微信服务平台管理", "基于该权限可代公众号调用在微信服务平台购买的API资源" },
    { 89, "服务号订阅通知", "基于该权限可帮助服务号使用订阅通知" },
}

local authority = {}

for i, d in ipairs(miniprogram_authority) do
    local f = {
        id = d[1], name = d[2], desc = d[3],
        is_mutex    = d[4] and true or false,
        doc_title   = d[5] or "",
        doc_link    = d[6] or "",
    }
    miniprogram_authority[i] = f
    authority[f.id] = f
end

for i, d in ipairs(offical_account_authority) do
    local f = {
        id = d[1], name = d[2], desc = d[3],
        is_mutex    = d[4] and true or false,
        doc_title   = d[5] or "",
        doc_link    = d[6] or "",
    }
    offical_account_authority[i] = f
    authority[f.id] = f
end

-- 填充权限集
__.set_authority = function(f)

    if type(f) ~= "table" then return f end

    local d = authority[f.id]
    if not d then return f end

    for k, v in pairs(d) do
        f[k] = v
    end

    return f

end

-- 取得权限集
__.get_authority = function(id)
    return authority[id]
end

-- 小程序权限集说明
__.get_miniprogram_authority = function()
    return miniprogram_authority
end

-- 公众号权限集
__.get_offical_account_authority = function()
    return miniprogram_authority
end

return __
